# 생일 맞추기
def main():
    day = 0     # 생일 저장

    dates = [
        [[1, 3, 5, 7],
         [9, 11, 13, 15],
         [17, 19, 21, 23],
         [25, 27, 29, 31]],
        [[2, 3, 6, 7],
         [10, 11, 14, 15],
         [18, 19, 22, 23],
         [26, 27, 30, 31]],
        [[4, 5, 6, 7],
         [12, 13, 14, 15],
         [20, 21, 22, 23],
         [28, 29, 30, 31]],
        [[8, 9, 10, 11],
         [12, 13, 14, 15],
         [24, 25, 26, 27],
         [28, 29, 30, 31]],
        [[16, 17, 18, 19],
         [20, 21, 22, 23],
         [24, 25, 26, 27],
         [28, 29, 30, 31]]]

    for i in range(5):
        print("생일이 집합? " + str(i+1) + "에 존재하나요?")

        for j in range(4):
            for k in range(4):
                print(format(dates[i][j][k], "4d"), end=" ")
            print()

        answer = eval(input("No이면 0, Yes이면 1을 입력하세요: "))

        if answer == 1:
            day += dates[i][0][0]

    print("당신의 생일은 " + str(day) + "입니다.")

main()